In [1]:
import numpy as np
import pandas as pd

# 4.2 Pandas

No; hoy no hablaremos del animal :'( 

Se trata de un paquete de Python, y el nombre hace referencia tanto a _Panel Data_ (en Econometría, una forma común de acomodar datos), como a _Python Data Analysis_.

Busca copiar los _Data Frames_ de lenguajes e Programación orientados al análisis, como _R_. Para su desarrollo, se basaron en NumPy, pero agregando funcionalidades nuevas. 

A todo esto...

### ¿Qué es un _Data Frame_?

Es una tabla.

.

.

.

Es mismo el formato con el que seguramente trabajaste alguna vez en Excel: datos acomodados en filas y en columnas.

Pero, espera...¡las matrices  (y los arreglos de NumPy) también tienen filas y columnas!

Entonces, ¿qué distingue a los _Data Frames_?

Vamos a ver cómo se ve uno, a ver si distingues las diferencias...

In [5]:
data = pd.read_csv("sample_data/california_housing_test.csv")
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [6]:
# Así se vería el mismo dataset, pero en NumPy...
data.to_numpy()

array([[-1.22050e+02,  3.73700e+01,  2.70000e+01, ...,  6.06000e+02,
         6.60850e+00,  3.44700e+05],
       [-1.18300e+02,  3.42600e+01,  4.30000e+01, ...,  2.77000e+02,
         3.59900e+00,  1.76500e+05],
       [-1.17810e+02,  3.37800e+01,  2.70000e+01, ...,  4.95000e+02,
         5.79340e+00,  2.70500e+05],
       ...,
       [-1.19700e+02,  3.63000e+01,  1.00000e+01, ...,  2.20000e+02,
         2.28950e+00,  6.20000e+04],
       [-1.17120e+02,  3.41000e+01,  4.00000e+01, ...,  1.40000e+01,
         3.27080e+00,  1.62500e+05],
       [-1.19630e+02,  3.44200e+01,  4.20000e+01, ...,  2.60000e+02,
         8.56080e+00,  5.00001e+05]])

## Características de los Data Frames:

* Cada columna es de un tipo de Dato (texto, numérico...)
 * Esto porque en sí, cada columna es su propia estructura de datos, llamadas __Series.__
* Tienen títulos.
  * Normalmente, sólo en las columnas, pero cada hilera también podría tener su propio título.

De hecho, ya conocíamos otra estructura de Datos con títulos: los _diccionarios_. No obstante, para análisis de datos, preferimos los _Data Frames_ ya que:
* Son compatibles con la mayoría de las funciones de NumPy.
* Permiten manipular facilmente grandes cantidades de datos.

## Creando Data Frames

1. Desde cero.

In [18]:
df = pd.DataFrame([1, 2, 3])
df.head()

   0
0  1
1  2
2  3

2. Transformando un diccionario.

In [25]:
diccionario = {"Nombre": ["Pikachu", "Mewtwo", "Greninja"],
               "Tipo": ["Eléctrico", "Psíquico", "Agua/Luchador"],
               "Nivel": [5, 50, 36]}

df2 = pd.DataFrame(diccionario)
df2.head()

     Nombre           Tipo  Nivel
0   Pikachu      Eléctrico      5
1    Mewtwo       Psíquico     50
2  Greninja  Agua/Luchador     36

3. Convirtiendo un arreglo de NumPy

In [26]:
arreglo = np.array([[5, 10, 13],
                    [12, 11, 15],
                    [2, 3, 3]])
arreglo

array([[ 5, 10, 13],
       [12, 11, 15],
       [ 2,  3,  3]])

In [28]:
df3 = pd.DataFrame(arreglo, columns=["Ancho", "Largo", "Altura"])
df3

   Ancho  Largo  Altura
0      5     10      13
1     12     11      15
2      2      3       3

4. Trayendo datos desde fuentes externas.

    (La forma más común).

In [29]:
# ¿Te suena?
data = pd.read_csv("sample_data/california_housing_test.csv")
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

Nota: el método `.head()` ayuda a previsualizar el _Data Frame_. Como, a partir de ahora, veremos cantidades de datos más grandes, ver _TODOS_ los datos de golpe puede ser abrumador.

In [30]:
# Normalmente, veremos las primeras cinco hileras
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [31]:
# Pero podemos especificar otra cantidad de datos
data.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0
5    -119.56     36.51  ...         1.6635             67000.0
6    -121.43     38.63  ...         1.6641             67000.0
7    -120.65     35.48  ...         3.2250            166900.0
8    -122.84     38.40  ...         3.6696            194400.0
9    -118.02     34.08  ...         2.3333            164200.0

[10 rows x 9 columns]

In [32]:
# E igualmente, con .tail podemos ver la parte final de los datos
data.tail()

      longitude  latitude  ...  median_income  median_house_value
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[5 rows x 9 columns]